/*
 * @Author: 秦琛
 * @LastEditors: 秦琛
 * @description: 全局变量
 * @Date: 2022-05-16 14:51:42
 * @LastEditTime: 2022-05-16 14:53:49
 */
export default  {
    // 套餐类型
    $mealType: {
        0: '包量',
        1: '包时',
        10: '计次',
        20: '福利',
        70: '不限量'
    },
    // 套餐变更类型
    $mealChangeType: {
        1: '合并套餐',
        2: '修改时效',
        3: '补量',
        4: '临时补量',
        5: '补偿',
        6: '续费'
    },
    // 套餐状态
    $mealState: {
        1: '正常',
        2: '禁用',
        3: '用完',
        4: '过期',
    } 
  }
  
